### Pandas 数据处理

### Series
Series 是一种类似于一维数组的对象，他是由一组数据不同数据类型与一组与之相关的数据标签或者索引组成

#### 数据列表创建一个简单的Series

In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([1, 'a', 5.2, 7])

In [3]:
# 左侧为索引，右侧为数据
s1

0      1
1      a
2    5.2
3      7
dtype: object

In [4]:
# 获取索引
s1.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
# 获取数据
s1.values

array([1, 'a', 5.2, 7], dtype=object)

#### 创建一个具有标签的Series

In [7]:
s2 = pd.Series([1, 'a', 5.2, 7], index=['a', 'b', 'c', 'd'])

In [8]:
s2

a      1
b      a
c    5.2
d      7
dtype: object

In [9]:
s2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
s2.values

array([1, 'a', 5.2, 7], dtype=object)

In [11]:
#### 使用python字典创建Series
sdata = {'Ohio': 35000, 'Texas': 72000, 'Oregon': 16000, 'Utah':5000}

In [12]:
s3 = pd.Series(sdata)

In [13]:
s3

Ohio      35000
Texas     72000
Oregon    16000
Utah       5000
dtype: int64

### DataFrame
- 每列可以是不同的数据类型
- 既有行索引也有列索引
- 可以看做是Series组成的字典

#### 多个字典序列创建dataframe

In [15]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9]
}
df = pd.DataFrame(data)

In [16]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [17]:
df.dtypes

state     object
year       int64
pop      float64
dtype: object

In [18]:
df.columns

Index(['state', 'year', 'pop'], dtype='object')

In [19]:
df.index

RangeIndex(start=0, stop=5, step=1)

#### 从DataFrame查询出Series
- 一列返回的是Series
- 多列返回的是DataFrame

In [20]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [21]:
df['year']

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [22]:
type(df['year'])

pandas.core.series.Series

In [23]:
df[['year', 'pop']]

   year  pop
0  2000  1.5
1  2001  1.7
2  2002  3.6
3  2001  2.4
4  2002  2.9

In [24]:
type(df[['year', 'pop']])

pandas.core.frame.DataFrame

#### 查询一行

In [25]:
df.loc[1]

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

In [26]:
type(df.loc[1])

pandas.core.series.Series

#### 查询多行

In [27]:
df.loc[1:3]

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4

In [28]:
type(df.loc[1:3])

pandas.core.frame.DataFrame